# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Scott_Schmit\Desktop\Cypress\PSoC\PSoC3\PSoC3 Wireless\CY8CKIT_003_RX\CY8CKIT_003_RX.cydsn\CY8CKIT_003_RX.cyprj
# Date: Mon, 27 Aug 2012 14:54:23 GMT
#set_units -time ns
create_clock -name {ClockBlock/clk_bus} -period 41.666666666666664 -waveform {0 20.8333333333333} [get_pins {ClockBlock/clk_bus}]
create_clock -name {ClockBlock/dclk_0} -period 500 -waveform {0 250} [get_pins {ClockBlock/dclk_0}]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {RadioController_IntClock} -source [get_pins {ClockBlock/clk_sync}] -divide_by 12 -duty_cycle 50 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -duty_cycle 50 [list [get_pins {ClockBlock/clk_bus_glb}]]


# Component constraints for C:\Users\Scott_Schmit\Desktop\Cypress\PSoC\PSoC3\PSoC3 Wireless\CY8CKIT_003_RX\CY8CKIT_003_RX.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Scott_Schmit\Desktop\Cypress\PSoC\PSoC3\PSoC3 Wireless\CY8CKIT_003_RX\CY8CKIT_003_RX.cydsn\CY8CKIT_003_RX.cyprj
# Date: Mon, 27 Aug 2012 14:54:19 GMT
